import {
  Studie,
  Researcher
} from '@/types/DatasetTypes'

export const studies: Studie[] = [
  {
    title: 'High Performance 지식 표현',
    date: '2020. 07 ~ 2027. 12',
    ongoing: true
  },
  {
    title: '(3세부과제) 스마트 에듀팜 활용을 위한 IoT 교육프로 그램 개발',
    date: '2021. 04 ~ 2022. 09'
  },
  {
    title: 'CNN 기반의 가짜뉴스 탐지',
    date: '2022. 02 ~ 2023. 03'
  },
  {
    title: '최신 산업 분야 투자 및 지원을 위한 메타버스 기술 및 시장에 관한 연구',
    date: '2022. 08 ~ 2022. 09'
  },
  {
    title: '양자컴퓨터 SW알고리즘 기초 연구 및 양자SW 전문 인재양성 육성 연구 및 지식 습득',
    date: '2022. 09 ~ 2022. 12'
  }
]

export const researchers: Researcher[] = [
  {
    name: '박지혁',
    grade: 4,
    contribute: '캡트톤 디자인 참여',
    interest: ['웹', 'DevOps'],
    description: '화이팅'
  },
  {
    name: '염휘건',
    grade: 4,
    contribute: '캡트톤 디자인 참여',
    interest: ['웹', '앱'],
    description: '안녕하세요'
  },
  {
    name: '이강일',
    grade: 4,
    contribute: '캡트톤 디자인 참여',
    interest: ['DevOps', '서버', '데이터']
  },
  {
    name: '유용찬',
    grade: 4,
    contribute: '캡트톤 디자인 참여',
    interest: ['웹', '앱', '게임'],
    description: '게임개발자(기획자)를 목표로 공부중인 Java를 주력으로 하는 예비 개발자'
  },
  {
    name: '정기태',
    grade: 4,
    contribute: '캡트톤 디자인 참여'
  },
  {
    name: '유현빈',
    grade: 4,
    contribute: '캡트톤 디자인 참여'
  },
  {
    name: '한재성',
    grade: 4,
    contribute: '캡트톤 디자인 참여',
    interest: ['웹', '게임']
  },
  {
    name: '추승우',
    grade: 4,
    contribute: '캡트톤 디자인 참여'
  },
  {
    name: '성민우',
    interest: ['웹', '보안', '서버'],
    grade: 3,
    class: '연구실장',
    description: '코이의 법칙'
  },
  {
    name: '이기성',
    grade: 3,
    class: '부연구실장',
    interest: ['창업', '기획', '건축'],
    description: '👍👍🏻👍🏼👍🏽👍🏾👍🏿 굿굿굿굿굿굿!'
  },
  {
    name: '송인섭',
    grade: 3,
    interest: ['보안', '인공지능', '데이터'],
    description: '안녕하세요. 저는 창업을 하고싶은 컴퓨터공학과 송인섭입니다.'
  },
  {
    name: '김규륭',
    grade: 3,
    note: '휴학'
  },
  {
    name: '강민경',
    grade: 3,
    interest: ['웹', '보안', '데이터']
  },
  {
    name: '안효선',
    grade: 3,
    interest: ['웹', '앱', '데이터', '게임']
  },
  {
    name: '윤시훈',
    grade: 2
  },
  {
    name: '장나정',
    grade: 2,
    note: '휴학'
  },
  {
    name: '이승준',
    grade: 2,
    interest: ['게임']
  },
  {
    name: '양수회',
    grade: 2,
    interest: ['앱', '웹', '서버'],
    description: '👍👍'
  },
  {
    name: '최민서',
    grade: 1,
    description: '깍두기 / 랩장 희망자'
  },
  {
    name: '김유나',
    grade: 1,
    interest: ['인공지능']
  },
  {
    name: '신민주',
    grade: 1,
    interest: ['서버'],
    description: '.'
  },
  {
    name: '이수현',
    grade: 1,
    description: '병아리'
  },
  {
    name: '김윤아',
    grade: 1,
    interest: ['서버', '인공지능', '데이터'],
    description: '열심히 노력하는 연구원이 되도록 하겠습니다.'
  },
  {
    name: '이현정',
    grade: 1,
    interest: ['웹', '앱', '임베디드', '보안', '서버', '인공지능', '데이터', '게임'],
    description: '여러 분야에 관심이 많고, 열정도 많은 연구원 입니다 🙂'
  },
  {
    name: '김준영',
    grade: 1,
    interest: ['서버', '데이터'],
    description: '다양한 지식들을 통해서 연구원들에게 도움이 될 수 있는 사람.'
  },
  {
    name: '이창록',
    grade: 1,
    interest: ['게임'],
    description: '짝수반 1학년 이창록입니다.'
  },
  {
    name: '김성현',
    grade: 1,
    interest: ['앱']
  },
  {
    name: '조현우',
    grade: 1
  },
  {
    name: '오현준',
    grade: 1,
    interest: ['웹', '보안'],
    description: '안녕하세요 오현준입니다'
  }
]
